In [9]:
import pandas as pd

d = {"Sr":["Ahmad","Ali","Usman","Safdar","Danish"],"Score":[2,3,4,5,6],"age":['6','8','27','10','16']}
d

{'Sr': ['Ahmad', 'Ali', 'Usman', 'Safdar', 'Danish'],
 'Score': [2, 3, 4, 5, 6],
 'age': ['6', '8', '27', '10', '16']}

In [24]:
df = pd.DataFrame(d)

df["age"] = df["age"].astype(int)
df

       Sr  Score  age
0   Ahmad      2    6
1     Ali      3    8
2   Usman      4   27
3  Safdar      5   10
4  Danish      6   16

In [25]:
df.describe()

          Score        age
count  5.000000   5.000000
mean   4.000000  13.400000
std    1.581139   8.473488
min    2.000000   6.000000
25%    3.000000   8.000000
50%    4.000000  10.000000
75%    5.000000  16.000000
max    6.000000  27.000000

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
type(df["Score"])

pandas.core.series.Series

Save csv_file

In [30]:
df.to_csv("socre_list.csv")

In [32]:
df1 = df.copy()
df1

       Sr  Score  age
0   Ahmad      2    6
1     Ali      3    8
2   Usman      4   27
3  Safdar      5   10
4  Danish      6   16

In [33]:
df.loc[3,"age"]=16
df

       Sr  Score  age
0   Ahmad      2    6
1     Ali      3    8
2   Usman      4   27
3  Safdar      5   16
4  Danish      6   16

In [34]:
df.iloc[3,2]=24
df

       Sr  Score  age
0   Ahmad      2    6
1     Ali      3    8
2   Usman      4   27
3  Safdar      5   24
4  Danish      6   16